Revit 2024 API
StructuralSectionLAngle.BoltDiameterLongerFlange Property
 Maximum bolt hole diameter in the longer flange, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double BoltDiameterLongerFlange { get; set; }
Visual Basic
Public Property BoltDiameterLongerFlange As Double
	Get
	Set
Visual C++
public:
property double BoltDiameterLongerFlange {
	double get ();
	void set (double value);
}
See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace